Pinned Property
 Identifies if the element has been pinned to prevent changes.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool Pinned { get; set; }
Visual Basic
Public Property Pinned As Boolean
	Get
	Set
Visual C++
public:
property bool Pinned {
	bool get ();
	void set (bool value);
}
Remarks
 An element which is pinned may not be moved, and warnings will be issued when an attempt is made to delete it.
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsInvalidOperationException |  When setting this property: Element cannot be pinned or unpinned.
See Also
Element Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →